"use client";
import { FC } from "react";
import scss from "./Cards.module.scss";
import Image from "next/image";
import { useRouter } from "next/navigation";
export interface IData {
  id: number;
  img: string;
  title: string;
  info: Info;
}

export interface Info {
  id: number;
  img: string;
  director: string;
  genre: string;
  premiere: string;
  duration: string;
  description: string;
}

const Cards: FC = () => {
  const data: IData[] = [
    {
      id: 1,
      img: "https://abal.kg/wp-content/uploads/2021/05/%D0%A1%D0%BA%D1%80%D0%B8%D0%BD%D1%88%D0%BE%D1%82-07-05-2021-124040.png",
      title: "Жамила",
      info: {
        id: 1,
        img: "https://sputnik.kg/img/103469/24/1034692483_0:0:1566:2048_600x0_80_0_0_b255304384f64800068e8f7b7024e808.jpg",
        director: "Ирина Поплавская",
        genre: "драма / согуштук драма",
        premiere: "1968-жылы СССРде.",
        duration: "83",
        description:
          "«Джамиля» тасмасы окуяны Жергиликтүү Кыргызстанда (кеңири айтканда – айылдык чөйрөдө) экинчи дүйнө согушу маалында баяндайт. Башкы каарман — жаш жана сулуу Жамиля, ал аялы болуп турган Садык согушка кеткенден кийин айылда калдырып кетилет. Сержанттык жумуштар, талаа иштери, элдин турмушу — баары согуштун таасиринде. Жамилянын жашоосу өзгөрөт: ал жөнөкөй аял эмес, өзүнүн жүрөгү менен, сезими менен жашоого умтулат.",
      },
    },
    {
      id: 2,
      img: "https://abal.kg/wp-content/uploads/2021/05/%D0%A1%D0%BA%D1%80%D0%B8%D0%BD%D1%88%D0%BE%D1%82-07-05-2021-124040.png",
      title: "Жамила",
      info: {
        id: 2,
        img: "https://sputnik.kg/img/103469/24/1034692483_0:0:1566:2048_600x0_80_0_0_b255304384f64800068e8f7b7024e808.jpg",
        director: "Ирина Поплавская",
        genre: "драма / согуштук драма",
        premiere: "1968-жылы СССРде.",
        duration: "83",
        description:
          "«Джамиля» тасмасы окуяны Жергиликтүү Кыргызстанда (кеңири айтканда – айылдык чөйрөдө) экинчи дүйнө согушу маалында баяндайт. Башкы каарман — жаш жана сулуу Жамиля, ал аялы болуп турган Садык согушка кеткенден кийин айылда калдырып кетилет. Сержанттык жумуштар, талаа иштери, элдин турмушу — баары согуштун таасиринде. Жамилянын жашоосу өзгөрөт: ал жөнөкөй аял эмес, өзүнүн жүрөгү менен, сезими менен жашоого умтулат.",
      },
    },
    {
      id: 3,
      img: "https://abal.kg/wp-content/uploads/2021/05/%D0%A1%D0%BA%D1%80%D0%B8%D0%BD%D1%88%D0%BE%D1%82-07-05-2021-124040.png",
      title: "Жамила",
      info: {
        id: 3,
        img: "https://sputnik.kg/img/103469/24/1034692483_0:0:1566:2048_600x0_80_0_0_b255304384f64800068e8f7b7024e808.jpg",
        director: "Ирина Поплавская",
        genre: "драма / согуштук драма",
        premiere: "1968-жылы СССРде.",
        duration: "83",
        description:
          "«Джамиля» тасмасы окуяны Жергиликтүү Кыргызстанда (кеңири айтканда – айылдык чөйрөдө) экинчи дүйнө согушу маалында баяндайт. Башкы каарман — жаш жана сулуу Жамиля, ал аялы болуп турган Садык согушка кеткенден кийин айылда калдырып кетилет. Сержанттык жумуштар, талаа иштери, элдин турмушу — баары согуштун таасиринде. Жамилянын жашоосу өзгөрөт: ал жөнөкөй аял эмес, өзүнүн жүрөгү менен, сезими менен жашоого умтулат.",
      },
    },
    {
      id: 4,
      img: "https://abal.kg/wp-content/uploads/2021/05/%D0%A1%D0%BA%D1%80%D0%B8%D0%BD%D1%88%D0%BE%D1%82-07-05-2021-124040.png",
      title: "Жамила",
      info: {
        id: 4,
        img: "https://sputnik.kg/img/103469/24/1034692483_0:0:1566:2048_600x0_80_0_0_b255304384f64800068e8f7b7024e808.jpg",
        director: "Ирина Поплавская",
        genre: "драма / согуштук драма",
        premiere: "1968-жылы СССРде.",
        duration: "83",
        description:
          "«Джамиля» тасмасы окуяны Жергиликтүү Кыргызстанда (кеңири айтканда – айылдык чөйрөдө) экинчи дүйнө согушу маалында баяндайт. Башкы каарман — жаш жана сулуу Жамиля, ал аялы болуп турган Садык согушка кеткенден кийин айылда калдырып кетилет. Сержанттык жумуштар, талаа иштери, элдин турмушу — баары согуштун таасиринде. Жамилянын жашоосу өзгөрөт: ал жөнөкөй аял эмес, өзүнүн жүрөгү менен, сезими менен жашоого умтулат.",
      },
    },
    {
      id: 5,
      img: "https://abal.kg/wp-content/uploads/2021/05/%D0%A1%D0%BA%D1%80%D0%B8%D0%BD%D1%88%D0%BE%D1%82-07-05-2021-124040.png",
      title: "Жамила",
      info: {
        id: 5,
        img: "https://sputnik.kg/img/103469/24/1034692483_0:0:1566:2048_600x0_80_0_0_b255304384f64800068e8f7b7024e808.jpg",
        director: "Ирина Поплавская",
        genre: "драма / согуштук драма",
        premiere: "1968-жылы СССРде.",
        duration: "83",
        description:
          "«Джамиля» тасмасы окуяны Жергиликтүү Кыргызстанда (кеңири айтканда – айылдык чөйрөдө) экинчи дүйнө согушу маалында баяндайт. Башкы каарман — жаш жана сулуу Жамиля, ал аялы болуп турган Садык согушка кеткенден кийин айылда калдырып кетилет. Сержанттык жумуштар, талаа иштери, элдин турмушу — баары согуштун таасиринде. Жамилянын жашоосу өзгөрөт: ал жөнөкөй аял эмес, өзүнүн жүрөгү менен, сезими менен жашоого умтулат.",
      },
    },
    {
      id: 6,
      img: "https://abal.kg/wp-content/uploads/2021/05/%D0%A1%D0%BA%D1%80%D0%B8%D0%BD%D1%88%D0%BE%D1%82-07-05-2021-124040.png",
      title: "Жамила",
      info: {
        id: 6,
        img: "https://sputnik.kg/img/103469/24/1034692483_0:0:1566:2048_600x0_80_0_0_b255304384f64800068e8f7b7024e808.jpg",
        director: "Ирина Поплавская",
        genre: "драма / согуштук драма",
        premiere: "1968-жылы СССРде.",
        duration: "83",
        description:
          "«Джамиля» тасмасы окуяны Жергиликтүү Кыргызстанда (кеңири айтканда – айылдык чөйрөдө) экинчи дүйнө согушу маалында баяндайт. Башкы каарман — жаш жана сулуу Жамиля, ал аялы болуп турган Садык согушка кеткенден кийин айылда калдырып кетилет. Сержанттык жумуштар, талаа иштери, элдин турмушу — баары согуштун таасиринде. Жамилянын жашоосу өзгөрөт: ал жөнөкөй аял эмес, өзүнүн жүрөгү менен, сезими менен жашоого умтулат.",
      },
    },
    {
      id: 7,
      img: "https://abal.kg/wp-content/uploads/2021/05/%D0%A1%D0%BA%D1%80%D0%B8%D0%BD%D1%88%D0%BE%D1%82-07-05-2021-124040.png",
      title: "Жамила",
      info: {
        id: 7,
        img: "https://sputnik.kg/img/103469/24/1034692483_0:0:1566:2048_600x0_80_0_0_b255304384f64800068e8f7b7024e808.jpg",
        director: "Ирина Поплавская",
        genre: "драма / согуштук драма",
        premiere: "1968-жылы СССРде.",
        duration: "83",
        description:
          "«Джамиля» тасмасы окуяны Жергиликтүү Кыргызстанда (кеңири айтканда – айылдык чөйрөдө) экинчи дүйнө согушу маалында баяндайт. Башкы каарман — жаш жана сулуу Жамиля, ал аялы болуп турган Садык согушка кеткенден кийин айылда калдырып кетилет. Сержанттык жумуштар, талаа иштери, элдин турмушу — баары согуштун таасиринде. Жамилянын жашоосу өзгөрөт: ал жөнөкөй аял эмес, өзүнүн жүрөгү менен, сезими менен жашоого умтулат.",
      },
    },
    {
      id: 8,
      img: "https://abal.kg/wp-content/uploads/2021/05/%D0%A1%D0%BA%D1%80%D0%B8%D0%BD%D1%88%D0%BE%D1%82-07-05-2021-124040.png",
      title: "Жамила",
      info: {
        id: 8,
        img: "https://sputnik.kg/img/103469/24/1034692483_0:0:1566:2048_600x0_80_0_0_b255304384f64800068e8f7b7024e808.jpg",
        director: "Ирина Поплавская",
        genre: "драма / согуштук драма",
        premiere: "1968-жылы СССРде.",
        duration: "83",
        description:
          "«Джамиля» тасмасы окуяны Жергиликтүү Кыргызстанда (кеңири айтканда – айылдык чөйрөдө) экинчи дүйнө согушу маалында баяндайт. Башкы каарман — жаш жана сулуу Жамиля, ал аялы болуп турган Садык согушка кеткенден кийин айылда калдырып кетилет. Сержанттык жумуштар, талаа иштери, элдин турмушу — баары согуштун таасиринде. Жамилянын жашоосу өзгөрөт: ал жөнөкөй аял эмес, өзүнүн жүрөгү менен, сезими менен жашоого умтулат.",
      },
    },
    {
      id: 9,
      img: "https://abal.kg/wp-content/uploads/2021/05/%D0%A1%D0%BA%D1%80%D0%B8%D0%BD%D1%88%D0%BE%D1%82-07-05-2021-124040.png",
      title: "Жамила",
      info: {
        id: 9,
        img: "https://sputnik.kg/img/103469/24/1034692483_0:0:1566:2048_600x0_80_0_0_b255304384f64800068e8f7b7024e808.jpg",
        director: "Ирина Поплавская",
        genre: "драма / согуштук драма",
        premiere: "1968-жылы СССРде.",
        duration: "83",
        description:
          "«Джамиля» тасмасы окуяны Жергиликтүү Кыргызстанда (кеңири айтканда – айылдык чөйрөдө) экинчи дүйнө согушу маалында баяндайт. Башкы каарман — жаш жана сулуу Жамиля, ал аялы болуп турган Садык согушка кеткенден кийин айылда калдырып кетилет. Сержанттык жумуштар, талаа иштери, элдин турмушу — баары согуштун таасиринде. Жамилянын жашоосу өзгөрөт: ал жөнөкөй аял эмес, өзүнүн жүрөгү менен, сезими менен жашоого умтулат.",
      },
    },
    {
      id: 10,
      img: "https://abal.kg/wp-content/uploads/2021/05/%D0%A1%D0%BA%D1%80%D0%B8%D0%BD%D1%88%D0%BE%D1%82-07-05-2021-124040.png",
      title: "Жамила",
      info: {
        id: 10,
        img: "https://sputnik.kg/img/103469/24/1034692483_0:0:1566:2048_600x0_80_0_0_b255304384f64800068e8f7b7024e808.jpg",
        director: "Ирина Поплавская",
        genre: "драма / согуштук драма",
        premiere: "1968-жылы СССРде.",
        duration: "83",
        description:
          "«Джамиля» тасмасы окуяны Жергиликтүү Кыргызстанда (кеңири айтканда – айылдык чөйрөдө) экинчи дүйнө согушу маалында баяндайт. Башкы каарман — жаш жана сулуу Жамиля, ал аялы болуп турган Садык согушка кеткенден кийин айылда калдырып кетилет. Сержанттык жумуштар, талаа иштери, элдин турмушу — баары согуштун таасиринде. Жамилянын жашоосу өзгөрөт: ал жөнөкөй аял эмес, өзүнүн жүрөгү менен, сезими менен жашоого умтулат.",
      },
    },
  ];
  const router = useRouter();
  return (
    <section className={scss.Cards}>
      <div className="container">
        <div className={scss.content}>
          <h1>Спектакли</h1>
          <div className={scss.cards}>
            {data.map((el) => (
              <div key={el.id} className={scss.card}>
                <div className={scss.imageWrapper}>
                  <Image
                    onClick={() => router.push(`/details/${el.id}`)}
                    src={el.img}
                    alt={el.title}
                    fill
                    style={{ objectFit: "cover", borderRadius: "10px" }}
                  />
                </div>
                <h3>{el.title}</h3>
              </div>
            ))}
          </div>
        </div>
      </div>
    </section>
  );
};

export default Cards;
